<template>
  <div v-scroll-lock="callbackPopupIsOpen">
    <Header />
    <Banner />
    <Workflow />
    <CallbackSection />
    <Benefits />
    <BasicSection waved=true>
      <template>
        <div class="anchor" id="burenie_skvajin"/>
        <div class="container">
          <h2>Бурение скважин</h2>
          <p>Команда наших профессионалов быстро и качественно выполнит самые сложные виды работ. Компактная и современная буровая установка в самые короткие сроки монтируются на участок, без повреждения ландшафта.</p>
        </div>
        <WorkDescription>
          <template>
            <img src="@/assets/img/burenie.webp" alt="Фотография работающего бура">
            <p>Используемая нами установка Ураган-2 - это компактная и производительная техника, с помощью которой, мы осуществляем бурение скважин до 80 метров в глубину. Благодаря её малогабаритности, выполнение работ происходит с наибольшей точностью и аккуратностью.</p>
          </template>
        </WorkDescription>
      </template>
    </BasicSection>
    <BasicSection waved=true>
      <template>
        <div class="anchor" id="obustroistvo_i_avtomatizaciya"/>
        <div class="container">
          <h2>Обустройство и автоматизация</h2>
          <p>Автоматизация в разы облегчает пользование скважиной и делает его комфортным, аналогично системе центрального водоснабжения.</p>
        </div>
        <WorkDescription is-right-side=true>
          <template>
            <img src="@/assets/img/automatization.webp" alt="Фотография автоматизированной системы водопровода">
            <p>Для большего удобства мы предлагаем нашим заказчикам услуги по автоматизации скважин. Вам не нужно самостоятельно проверять уровень воды, температуру и давление - это за вас сделает автоматика!</p>
          </template>
        </WorkDescription>
        <div class="container">
          <p>
            Обустройство скважины достаточно сложный и трудоёмкий процесс, который эксперты советуют доверять исключительно профессионалам. Как правило, этот процесс включает в себя установку гидроаккумулятора, насоса, прокладку трубопровода. По завершению проводится тестирование всей системы, настраивается автоматика и система управления.
          </p>
          <p>
            Мы с радостью ответим на все интересующие вас вопросы, поможем подобрать материалы и оборудование для обустройства. Бригада наших квалифицированных сотрудников быстро и качественно выполнит работы любой сложности.
          </p>
        </div>
      </template>
    </BasicSection>
    <BasicSection waved=true>
      <template>
        <div class="anchor" id="vodoprovod_i_kanalizaciya"/>
        <div class="container">
          <h2>Водопровод и канализация</h2>
          <p>Канализация – важнейшая часть в доме. Без её наличия в загородном доме, у его жителей не будет нужного комфорта и удобства. Именно поэтому установку канализационной системы нужно доверять лишь опытным специалистам.</p>
        </div>
        <WorkDescription>
          <template>
            <img src="@/assets/img/vodoprovod.webp" alt="Фотография бойлера с трубами">
            <p>Компания «Акватерра» гарантирует вам абсолютное качество работ и исключительно профессиональный подход. Наши специалисты оборудуют как внутреннюю, так и внешнюю систему канализации, в соответствии с вашим проектом.</p>
          </template>
        </WorkDescription>
        <div class="container">
          <h3>Монтаж наружного и внутреннего водопровода</h3>
          <p>Если вы желаете не только сберечь пространство, но и обезопасить воду от воздействия различных внешних факторов, то отличным решением здесь является комплексный монтаж трубопровода.</p>
          <p>Мы предлагаем монтаж системы водоснабжения: наружного и внутреннего водопровода.</p>
          <p>Наружный трубопровод может монтироваться уже на этапе бурения скважины, что значительно сэкономит ваше время. При таком типе монтажа, трубы прокладывают под землей снаружи построек и сооружений.</p>
          <p>Внутренний трубопровод прокладывается внутри помещения и при его монтаже есть множество нюансов, один из которых – температурный режим. Поэтому такие мероприятия должны быть выполнены только профессионально обученными специалистами.</p>
          <h3>Заказывая монтаж систем водопровода в компании Акватерра, будьте уверены что:</h3>
          <p>• Весь процесс выполняет бригада профессионалов</p>
          <p>• По завершению работ система тестируется и перепроверяется</p>
          <p>• С целью предотвращения возможных пробоев и течей мы обязательно проводим комплекс специальных мероприятий, для наилучшего качества работы.</p>
        </div>
      </template>
    </BasicSection>
    <BasicSection>
      <template>
        <div class="anchor" id="otoplenie_i_teply_pol"/>
        <div class="container">
          <h2>Отопление и тёплые полы</h2>
          <p>Выбрав систему обогрева «Теплый пол», вы обеспечиваете здоровый микроклимат в своём доме, ведь такой вид отопления не сушит воздух и абсолютно экологичен. Еще одно большое преимущество – это экономия пространства, ведь массивные радиаторы и батареи больше не нужны.</p>
        </div>
        <WarmFloor />
        <div class="container">
          <p>Тёплый пол очень прост в управлении и гарантирует вам высокую точность в поддержании благоприятной атмосферы помещения.</p>
        </div>
      </template>
    </BasicSection>
    <CallbackSection />
    <BasicSection waved=true>
      <template>
        <div class="anchor" id="o_kompanii"/>
        <div class="container">
          <h2>О компании</h2>
          <p>Компания «Акватерра» на протяжении семи лет профессионально занимается такими видами работ, как:</p>
          <AboutList />
          <p>Мы полностью уверены в качестве наших услуг и предоставляем вам гарантию 2 года на наши работы по бурению скважин.</p>
        </div>
      </template>
    </BasicSection>
    <BasicSection>
      <template>
        <div class="anchor" id="kak_my_rabotaem"/>
        <div class="container">
          <h2>Как мы работаем </h2>
          <p>Начать сотрудничать с нами очень просто!</p>
          <HowWeWork />
        </div>
      </template>
    </BasicSection>
    <Footer id="contacts"/>
    <Lightbox>
      <CallbackPopup/>
    </Lightbox>
  </div>
</template>

<script>
export default {
  name: 'IndexPage',
  computed: {
    callbackPopupIsOpen() {
      return this.$store.state.popups.callbackPopupIsOpen 
    }
  },
}
</script>